/******************************************************************************

                            Aula 6.1
                Link: https://youtu.be/5fSf9xSJK7c

*******************************************************************************/

#include <stdio.h>

int main () {
    int v[5];
    
    float m;
    
    v[0] = 50;
    v[1] = 40;
    v[2] = 30;
    v[3] = 20;
    v[4] = 10;
    
    m = (v[0] + v[1] + v[2] + v[3] + v[4]) / 5;
    
    printf("Resultado: %f\n", m);
}

/*******************************************************************************
 Sintaxe Vetores:
    <tipo> <nome>[tamanho];
 --------------------------------------------------------------------------
 Acesso a uma posição: não é possível acessar um vetor todo 
    <nome>[<índice>]
 
 Lista de inicialização: preenche um vetor todo, de uma vez só
    <tipo> <nome>[<tam.>] = {<v1>, <v2>, ..., <vN>};
    
*******************************************************************************/